{
  "properties": {
    "memory": "Use this tool to store and retrieve persistent memory across sessions.",
    "context7": "Use this tool to search, index, and retrieve project documentation.",
    "supabase": "Use this tool to interact with your Supabase database (query, insert, update).",

    "1mcpserver": "Use this tool to auto-discover and configure other MCP servers on your machine.",
    "21st.dev Magic": "Use this tool to generate polished UI components inspired by 21st.dev patterns.",
    "4everland/4everland-hosting-mcp": "Use this tool to deploy sites and assets to decentralized storage (IPFS/Arweave) via 4EVERLAND.",
    "Adfin": "Use this tool to manage invoicing, accounting, and payment reconciliation.",
    "Agent Mindshare": "Use this tool to track brand/agent mentions and share-of-voice across AI platforms.",
    "AgentQL": "Use this tool to extract structured data from web pages using AgentQL queries.",
    "AgentRPC": "Use this tool to call remote functions and services via RPC from your agent.",
    "Alby Bitcoin Payments MCP": "Use this tool to send and receive Bitcoin Lightning payments via Alby.",
    "AllVoiceLab": "Use this tool to clone voices, synthesize speech, and translate audio.",
    "Apify": "Use this tool to run Apify actors for web automation and data extraction.",
    "APIMatic MCP": "Use this tool to validate and transform OpenAPI/SDK assets with APIMatic.",
    "Bright Data": "Use this tool to crawl and collect public web data at scale.",
    "Box": "Use this tool to search, read, and manage files and folders in Box.",
    "Chart": "Use this tool to generate charts and visuals (AntV) from your data.",
    "Chroma": "Use this tool to store embeddings and perform vector search with Chroma.",
    "Cloudflare": "Use this tool to manage Cloudflare resources (DNS, KV, Pages, Workers).",
    "CoinGecko": "Use this tool to fetch cryptocurrency prices and market data.",
    "Convex": "Use this tool to query data and run functions in your Convex backend.",
    "Couchbase": "Use this tool to query and manage data in Couchbase clusters.",
    "Driflyte": "Use this tool to search topic-focused knowledge from recursively crawled sources.",
    "ECharts": "Use this tool to render analytical charts using Apache ECharts.",
    "ElevenLabs": "Use this tool to generate speech, voices, and audio effects with ElevenLabs.",
    "GitHub": "Use this tool to interact with repositories: issues, PRs, code, and search.",
    "Neon": "Use this tool to manage and query serverless Postgres on Neon.",
    "Notion": "Use this tool to read, search, and update Notion pages and databases.",
    "Stripe": "Use this tool to create charges, customers, and manage payments in Stripe.",
    "Zapier": "Use this tool to connect to thousands of apps and run actions via Zapier.",

    "Sequential Thinking": "Use this tool to structure or chain reasoning steps for complex problem solving.",
    "wcgw": "Use this tool to run shell commands or code execution inside chat sessions.",
    "Brave Search MCP": "Use this tool to perform web searches via Brave Search.",
    "Web Research": "Use this tool to conduct web research with search + extraction workflows.",
    "iTerm MCP": "Use this tool to execute shell commands in an iTerm terminal session.",
    "TaskManager MCP": "Use this tool to manage, queue, and execute tasks within a session.",
    "SQLite MCP Server": "Use this tool to query and manage SQLite databases.",
    "Fetch": "Use this tool to fetch and return the contents of a web page or resource.",
    "Knowledge Graph Memory Server": "Use this tool to store and query persistent knowledge graphs.",
    "Playwright MCP": "Use this tool to automate browsers and interact with websites.",
    "MySQL MCP Server": "Use this tool to query and manage MySQL databases.",
    "Audiense Insights MCP": "Use this tool to fetch audience analytics and marketing insights via Audiense.",
    "Exa Search": "Use this tool to perform semantic search across the real-time web.",
    "Filesystem MCP": "Use this tool to read, write, and list files on the filesystem.",
    "Git MCP": "Use this tool to interact with local Git repositories.",
    "YAML MCP": "Use this tool to parse, validate, and update YAML files.",
    "Terraform MCP Server": "Use this tool to explore and query Terraform modules and registries.",
    "MongoDB MCP Server": "Use this tool to query and manage MongoDB collections and Atlas databases."
  }
}